api/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "avatar", "bio", "created_at", "updated_at", "email", "admin") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    user = User.create!(user_params)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]
---
  def destroy
    user = find_user
    user.destroy!

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def find_user
    User.find(params[:id])